DataProcessors/А_АвтоматическийОбменДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>А_АвтоматическийОбменДанными</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменУправлениеПредприятиемБухгалтерия20</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.КазначействоBASERP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыТранспортаСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаСообщенийОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EMAIL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FILE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WSПассивныйРежим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяСистема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыВыполненияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка_ТранспортСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение_СообщениеОбменаБылоРанееПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоСПредупреждениями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/А_АвтоматическийОбменДанными/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Узел-корреспондент указанного плана обмена в ТЕКУЩЕЙ базе.
//
// Имя плана — СТРОКА и ищется через метаданные, поэтому отсутствие плана в базе
// НЕ ломает компиляцию: в bas_industrialbud нет плана Казны, в kazna нет плана Бухгалтерии,
// и один и тот же модуль работает во всех трёх базах.
//
// Настройки транспорта здесь НЕ используются намеренно: в kazna регистр называется
// иначе (НастройкиТранспортаОбмена с измерением Узел, а не НастройкиТранспортаОбменаДанными
// с измерением Корреспондент), поэтому поиск узла по транспорту там просто падал бы.
//
// Параметры:
//  ИмяПлана - Строка - имя плана обмена в метаданных (из ПланОбмена.Метаданные().Имя).
//
// Возвращаемое значение:
//  ПланОбменаСсылка, Неопределено - узел (<> ЭтотУзел, не помечен на удаление),
//                                   либо Неопределено, если плана или узла в базе нет.
//
Функция УзелКорреспондентПлана(ИмяПлана) Экспорт

	Если Метаданные.ПланыОбмена.Найти(ИмяПлана) = Неопределено Тогда
		Возврат Неопределено; // плана нет в этой базе — это НЕ ошибка
	КонецЕсли;

	Менеджер = ПланыОбмена[ИмяПлана];

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтотУзел", Менеджер.ЭтотУзел());
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Узлы.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена." + ИмяПлана + " КАК Узлы
	|ГДЕ
	|	Узлы.Ссылка <> &ЭтотУзел
	|	И НЕ Узлы.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Узел;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Выполняет обмен ТЕКУЩЕЙ базы по указанному плану обмена (если план в ней есть).
// Обмен идёт серверным методом БСП, поэтому окно помощника интерактивного обмена
// открыться физически не может.
//
// Параметры:
//  ИмяПлана  - Строка - имя плана обмена в метаданных (из ПланОбмена.Метаданные().Имя).
//  Сообщения - Массив - (возвращаемый) читаемые строки-результаты.
//
// Возвращаемое значение:
//  Булево - Истина, если РЕАЛЬНЫХ ошибок не было.
//           Плана нет в этой базе -> Истина (нечего делать, это не ошибка).
//           «Нечего принимать» -> тоже НЕ ошибка (см. ДобавитьРезультатыПоУзлу).
//
Функция СинхронизироватьПоПлану(ИмяПлана, Сообщения = Неопределено) Экспорт

	Если Сообщения = Неопределено Тогда
		Сообщения = Новый Массив;
	КонецЕсли;

	Узел = УзелКорреспондентПлана(ИмяПлана);
	Если Узел = Неопределено Тогда
		Возврат Истина; // плана нет в этой базе — молча пропускаем
	КонецЕсли;

	ПараметрыОбмена = ОбменДаннымиСервер.ПараметрыОбмена();
	ПараметрыОбмена.ВидТранспортаСообщенийОбмена = Перечисления.ВидыТранспортаСообщенийОбмена.FILE;
	ПараметрыОбмена.ВыполнятьВыгрузку = Истина;
	ПараметрыОбмена.ВыполнятьЗагрузку = Истина;

	Отказ = Ложь;
	Попытка
		ОбменДаннымиСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(Узел, ПараметрыОбмена, Отказ);
	Исключение
		ЗаписьЖурналаРегистрации("А_АвтоматическийОбмен",
			УровеньЖурналаРегистрации.Ошибка, , Узел,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Сообщения.Добавить("Обмен с " + Строка(Узел) + ": ИСКЛЮЧЕНИЕ — "
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;

	// ВАЖНО: флагу Отказ доверять нельзя. БСП поднимает его даже когда обмен прошёл
	// нормально, а принимать было просто НЕЧЕГО: результат
	// Предупреждение_СообщениеОбменаБылоРанееПринято не входит в его список «выполнено»
	// (см. ОбменДаннымиСервер.РезультатВыполненияОбменаВыполнено).
	// Поэтому читаем ФАКТИЧЕСКИЙ результат по каждому действию из регистра состояний.
	Сообщения.Добавить("Обмен с " + Строка(Узел) + ":");
	Возврат ДобавитьРезультатыПоУзлу(Узел, Сообщения);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Читает фактический результат обмена по каждому действию (Выгрузка/Загрузка) и
// добавляет читаемые строки в Сообщения. Классификация делается в самом запросе
// (нативно в 1С — сравнение перечислений в коде не требуется).
//
// Возвращаемое значение:
//  Булево - Ложь, если есть РЕАЛЬНЫЕ ошибки (Ошибка, Ошибка_ТранспортСообщения, Отменено).
//           «Сообщение обмена было ранее принято» = нечего принимать, это НЕ ошибка.
//
Функция ДобавитьРезультатыПоУзлу(Узел, Сообщения)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Состояния.ДействиеПриОбмене) КАК ДействиеТекст,
	|	ПРЕДСТАВЛЕНИЕ(Состояния.РезультатВыполненияОбмена) КАК РезультатТекст,
	|	ВЫБОР
	|		КОГДА Состояния.РезультатВыполненияОбмена = ЗНАЧЕНИЕ(Перечисление.РезультатыВыполненияОбмена.Выполнено)
	|				ИЛИ Состояния.РезультатВыполненияОбмена = ЗНАЧЕНИЕ(Перечисление.РезультатыВыполненияОбмена.ВыполненоСПредупреждениями)
	|			ТОГДА ""OK""
	|		КОГДА Состояния.РезультатВыполненияОбмена = ЗНАЧЕНИЕ(Перечисление.РезультатыВыполненияОбмена.Предупреждение_СообщениеОбменаБылоРанееПринято)
	|			ТОГДА ""INFO""
	|		ИНАЧЕ ""ERR""
	|	КОНЕЦ КАК Класс
	|ИЗ
	|	РегистрСведений.СостоянияОбменовДанными КАК Состояния
	|ГДЕ
	|	Состояния.УзелИнформационнойБазы = &Узел
	|	И Состояния.ДействиеПриОбмене <> ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ПустаяСсылка)";

	БезОшибок = Истина;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Выборка.Класс = "ERR" Тогда
			БезОшибок = Ложь;
			Сообщения.Добавить("   " + Выборка.ДействиеТекст + ": ОШИБКА — " + Выборка.РезультатТекст);
		ИначеЕсли Выборка.Класс = "INFO" Тогда
			Сообщения.Добавить("   " + Выборка.ДействиеТекст + ": нечего принимать (сообщение уже было принято ранее)");
		Иначе
			Сообщения.Добавить("   " + Выборка.ДействиеТекст + ": выполнено");
		КонецЕсли;

	КонецЦикла;

	Возврат БезОшибок;

КонецФункции

#КонецОбласти
